const manSurnames = ["Иванов", "Смирнов", "Кузнецов", "Попов", "Васильев", "Петров", "Соколов", "Михайлов", "Новиков", "Федоров",
                    "Морозов", "Волков", "Алексеев", "Лебедев", "Семенов", "Егоров", "Павлов", "Козлов", "Степанов" , "Николаев",
                    "Орлов", "Андреев", "Макаров", "Никитин", "Захаров", "Зайцев", "Соловьев", "Борисов", "Яковлев", "Григорьев",
                    "Романов", "Воробьев", "Сергеев", "Кузьмин", "Фролов", "Александров", "Королев", "Гусев", "Киселев", "Поляков",
                    "Сорокин", "Виноградов", "Ковалев", "Белов", "Медведев", "Тарасов", "Жуков", "Баранов", "Филлипов", "Комаров",
                    "Давыдов", "Беляев", "Герасимов", "Осипов", "Сидоров", "Куликов", "Власов", "Мельников", "Тихонов", "Казаков",
                    "Фомин", "Чернов", "Абрамов", "Мартынов", "Ефимов", "Быков", "Маслов", "Воронин", "Голубев", "Соболев",
                    "Гончаров", "Грачев", "Котов", "Гришин", "Громов", "Бобров"];

const manNames = ["Александр", "Алексей", "Анатолий", "Андрей", "Антон", "Аркадий", "Артем", "Богдан", "Борис", "Вадим",
                 "Валерий", "Василий", "Виктор", "Виталий", "Владимир", "Владислав", "Геннадий", "Георгий", "Григорий", "Денис",
                 "Дмитрий", "Евгений", "Егор", "Иван", "Игорь", "Илья", "Кирилл", "Константин", "Лев", "Леонид",
                 "Максим", "Матвей", "Михаил", "Никита", "Николай", "Олег", "Павел", "Петр", "Роман", "Святослав",
                 "Семен", "Сергей", "Станислав", "Тимур", "Федор", "Филлип", "Эдуард", "Юрий", "Ярослав"];

const manPatronymics = ["Александрович", "Алексеевич", "Анатольевич", "Андреевич" ,"Антонович", "Аркадьевич", "Артемович", "Богданович", "Борисович", "Вадимович",
                       "Валерьевич", "Васильевич", "Викторович", "Витальевич", "Владимирович", "Владиславович", "Геннадьевич", "Георгиевич", "Григориевич", "Денисович",
                       "Дмитриевич", "Евгеньевич", "Егорович", "Иванович", "Игоревич", "Ильич", "Кириллович", "Константинович", "Львович", "Леонидович",
                       "Максимович", "Матвеевич", "Михайлович", "Никитич", "Николаевич", "Олегович", "Павлович", "Петрович", "Романович", "Святославович",
                       "Семенович", "Сергеевич", "Станиславович", "Тимурович", "Федорович", "Филлипович", "Эдуардович", "Юрьевич", "Ярославович"];

const womanSurnames = ["Иванова", "Смирнова", "Кузнецова", "Попова", "Васильева", "Петрова", "Соколова", "Михайлова", "Новикова", "Федорова",
                      "Морозова", "Волкова", "Алексеева", "Лебедева", "Семенова", "Егорова", "Павлова", "Козлова", "Степанова", "Николаева",
                      "Орлова", "Андреева", "Макарова", "Никитина", "Захарова", "Зайцева", "Соловьева", "Борисова", "Яковлева", "Григорьева",
                      "Романова", "Воробьева", "Сергеева", "Кузьмина", "Фролова", "Александрова", "Королева", "Гусева", "Киселева", "Полякова",
                      "Сорокина", "Виноградова", "Ковалева", "Белова", "Медведева", "Тарасова", "Жукова", "Баранова", "Филлипова", "Комарова",
                      "Давыдова", "Беляева", "Герасимова", "Осипова", "Сидорова", "Куликова", "Власова", "Мельникова", "Тихонова", "Казакова",
                      "Фомина", "Чернова", "Абрамова", "Мартынова", "Ефимова", "Быкова", "Маслова", "Воронина", "Голубева", "Соболева",
                      "Гончарова", "Грачева", "Котова", "Гришина", "Громова", "Боброва"];

const womanNames = ["Александра", "Алина", "Алла", "Анастасия", "Анна", "Валентина", "Валерия", "Варвара", "Василиса", "Вера",
                   "Виктория", "Галина", "Дарья", "Евгения", "Елена", "Елизавета", "Екатерина", "Ирина", "Карина", "Ксения",
                   "Лариса", "Лидия", "Любовь", "Маргарита", "Марина", "Мария", "Надежда", "Наталья", "Оксана", "Ольга",
                   "Полина", "Регина", "Светлана", "София", "Таисия", "Тамара", "Татьяна", "Ульяна", "Юлия", "Яна"];

const womanPatronymics = ["Александровна", "Алексеевна", "Анатольевна", "Андреевна", "Антоновна", "Аркадьевна", "Артемовна", "Богдановна", "Борисовна", "Вадимовна",
                         "Валерьевна", "Васильевна", "Викторовна", "Витальевна", "Владимировна", "Владиславовна", "Геннадьевна", "Георгиевна", "Григориевна", "Денисовна",
                         "Дмитриевна", "Евгеньевна", "Егоровна", "Ивановна", "Игоревна", "Ильинична", "Кирилловна", "Константиновна", "Львовна", "Леонидовна",
                         "Максимовна",  "Матвеевна", "Михайловна", "Никитична", "Николаевна", "Олеговна", "Павловна",  "Петровна", "Романовна", "Святославовна",
                         "Семеновна", "Сергеевна", "Станиславовна", "Тимуровна", "Федоровна", "Филлиповна", "Эдуардовна", "Юрьевна", "Ярославовна"];

function GetRandom(min, max)
{
    return Math.trunc(Math.random() * (max - min) + min);
}

function GetRandomNumber()
{
    numberBox.value = GetRandom(numberMin.value, numberMax.value - (-1));
}

function GetManNames()
{
    return manSurnames[GetRandom(0, 75)] + " " + manNames[GetRandom(0, 48)] + " " + manPatronymics[GetRandom(0, 48)];
}

function GetWomanNames()
{
    return womanSurnames[GetRandom(0, 75)] + " " + womanNames[GetRandom(0, 39)] + " " + womanPatronymics[GetRandom(0, 48)];
}

function GetRandomNames()
{
    let i = numberNames.value;
    let i1 = 0;

    if (chManNames.checked || chWomanNames.checked)
    {
        namesBox.value = "";
        while (i1 < i)
        {
            switch (GetRandom(0, 2))
            {
                case 0:
                if (chManNames.checked)
                {
                    namesBox.value += GetManNames() + '\n';
                    i1++;
                }
                break;
                case 1:
                if (chWomanNames.checked)
                    {
                    namesBox.value += GetWomanNames() + '\n';
                    i1++;
                }
                break;
            }
        } 
    }
    else
    {
        namesBox.value = "Не выбраны типы!";
    }
}
